In [27]:
import os  # This will be used to tell us where the file is
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('ggplot')

In [30]:
pwd = os.getcwd() # This creates a string that is the filepath to the simple_csv file
filepath = pwd + "/data/expats_edited.csv" # This creates a string that is the filepath to the simple_csv file
filepath

'c:\\Users\\MaxPC\\Documents\\GitHub\\expats_area_hcmc/data/expats_edited.csv'

In [31]:
expats = pd.read_csv(filepath) 
expats
# This reads the csv into Python

,#,user_id,country,age,dist_living,area_move,new_dist,usd_rent
0,1,id_345382,USA,54,District 2,No,District 7,"$2,000.00"
1,2,id_345575,USA,20,District 2,No,NaN,"$1,500.00"
2,3,id_345531,Korea,18,District 1,Yes,District 7,$700.00
3,4,id_345649,Korea,43,Tan Binh District,No,NaN,$600.00
4,5,id_345558,USA,35,District 2,No,NaN,"$2,500.00"
...,...,...,...,...,...,...,...,...
144,145,id_345500,Russia,56,District 7,No,NaN,$800.00
145,146,id_345431,India,25,Distrcit 4,No,NaN,$300.00
146,147,id_345650,Russia,54,District 7,No,NaN,$600.00
147,148,id_345455,Russia,35,District 7,No,NaN,$450.00
148,149,id_345433,France,34,District 2,No,NaN,"$2,500.00"

In [32]:
expats = expats.copy()
expats

,#,user_id,country,age,dist_living,area_move,new_dist,usd_rent
0,1,id_345382,USA,54,District 2,No,District 7,"$2,000.00"
1,2,id_345575,USA,20,District 2,No,NaN,"$1,500.00"
2,3,id_345531,Korea,18,District 1,Yes,District 7,$700.00
3,4,id_345649,Korea,43,Tan Binh District,No,NaN,$600.00
4,5,id_345558,USA,35,District 2,No,NaN,"$2,500.00"
...,...,...,...,...,...,...,...,...
144,145,id_345500,Russia,56,District 7,No,NaN,$800.00
145,146,id_345431,India,25,Distrcit 4,No,NaN,$300.00
146,147,id_345650,Russia,54,District 7,No,NaN,$600.00
147,148,id_345455,Russia,35,District 7,No,NaN,$450.00
148,149,id_345433,France,34,District 2,No,NaN,"$2,500.00"

In [33]:
expats.columns 
# See the list of columns

Index(['#', 'user_id', 'country', 'age', 'dist_living', 'area_move',
       'new_dist', 'usd_rent'],
      dtype='object')

In [72]:
expats.drop(['#','country','age','area_move','usd_rent'], inplace=True,axis=1)
expats

# Getting the list of column(s)

       user_id        dist_living    new_dist
0    id_345382         District 2  District 7
1    id_345575         District 2         NaN
2    id_345531         District 1  District 7
3    id_345649  Tan Binh District         NaN
4    id_345558         District 2         NaN
..         ...                ...         ...
144  id_345500         District 7         NaN
145  id_345431         Distrcit 4         NaN
146  id_345650         District 7         NaN
147  id_345455         District 7         NaN
148  id_345433         District 2         NaN

[149 rows x 3 columns]

In [34]:
expats.groupby("dist_living")["user_id"].count().reset_index().sort_values(by="user_id", ascending=False)
# Counting number of respondens by their currentl place of living

          dist_living  user_id
5          District 2       55
8          District 7       29
2          District 1       24
12  Tan Binh District       12
7          District 5        7
1          Distrcit 4        5
11          Phu Nhuan        5
0           Binh Tanh        3
3         District 10        3
9          District 8        2
10         District 9        2
4         District 11        1
6          District 3        1

In [35]:
expats.groupby("new_dist")["user_id"].count().reset_index().sort_values(by="user_id", ascending=False)
# Counting number of respondens who wants to change their place of living

     new_dist  user_id
3  District 7       25
2  District 4        8
0  District 1        5
1  District 2        1

In [36]:
pivot = expats.pivot_table(index=['dist_living'], values=['user_id'], aggfunc='count').reset_index()
pivot
#

          dist_living  user_id
0           Binh Tanh        3
1          Distrcit 4        5
2          District 1       24
3         District 10        3
4         District 11        1
5          District 2       55
6          District 3        1
7          District 5        7
8          District 7       29
9          District 8        2
10         District 9        2
11          Phu Nhuan        5
12  Tan Binh District       12

In [37]:
pivot = expats.pivot_table(index=['new_dist'], values=['user_id'], aggfunc='count').reset_index()
pivot
#

     new_dist  user_id
0  District 1        5
1  District 2        1
2  District 4        8
3  District 7       25

In [38]:
pivot.to_excel(pwd + "/Final_Output.xlsx", index = False)